
using System.Collections.Generic;
using CLLibrary;

public class KeywordCategory : Category<KeywordEntry>
{
    public KeywordCategory()
    {
        AddRange(new List<KeywordEntry>()
        {
            new("Keyword0001", "释放暴击", "可以在一次攻击中，使用掉全部的暴击"),
            new("Keyword0002", "释放吸血", "可以在一次攻击中，使用掉全部的吸血"),
            new("Keyword0003", "气血", "当归零时，战斗失败"),
            new("Keyword0004", "护甲", "下次受攻击时，攻击将被抵挡一部分"),
            new("Keyword0005", "破甲", "下次受攻击时，额外受到的攻击，会与护甲抵消"),
            new("Keyword0006", "吟唱", "左上角绿色角标代表吟唱，此牌需要消耗额外回合才能使用"),
            new("Keyword0007", "每回合", "每回合触发一次效果"),
            new("Keyword0008", "每轮", "每轮触发一次效果"),
            new("Keyword0009", "初次", "第一次使用时触发效果"),
            new("Keyword0010", "击伤", "攻击造成伤害时触发效果"),
            new("Keyword0011", "暴击", "造成伤害时，对方受到的伤害翻倍"),
            new("Keyword0012", "开局", "在战斗开始前，一张牌都未打出时，触发效果"),
            new("Keyword0013", "终结", "放置在最后一张时触发效果"),
            new("Keyword0014", "流转", "每个五行有一个基础Buff，分别是锋锐，格挡，力量，灼烧，坚毅。" +
                                     "\n根据不同的五行，一共有五种流转，金流转，水流转，木流转，火流转，土流转。" +
                                     "\n获得基础Buff时，会触发流转，消耗掉另一个五行的基础Buff，变成额外的层数。规则在不同的流转中有说明。"),
            new("Keyword0015", "金流转", "在拥有坚毅时获得锋锐，会消耗掉所有的坚毅，变成额外的锋锐层数。"),
            new("Keyword0016", "水流转", "在拥有锋锐时获得格挡，会消耗掉所有的锋锐，变成额外的格挡层数。"),
            new("Keyword0017", "木流转", "在拥有格挡时获得力量，会消耗掉所有的格挡，变成额外的力量层数。"),
            new("Keyword0018", "火流转", "在拥有力量时获得灼烧，会消耗掉所有的力量，变成额外的灼烧层数。"),
            new("Keyword0019", "土流转", "在拥有灼烧时获得坚毅，会消耗掉所有的灼烧，变成额外的坚毅层数。"),
            new("Keyword0020", "跟随流转", "将上次流转的产物，继续流转。上一次触发金流转的话，此次触发水流转。"),
            new("Keyword0021", "成长", "随着每次使用，卡牌会变得更强"),
            new("Keyword0022", "奇偶", "此牌位置是奇数时触发前一个效果，是偶数时触发后一个效果"),
            new("Keyword0023", "架势", "消耗架势激活效果，没有架势时获得架势"),
            new("Keyword0024", "二动", "这回合可以行动两次，一回合只能触发一次二动/三动"),
            new("Keyword0025", "三动", "这回合可以行动三次，一回合只能触发一次二动/三动"),
            new("Keyword0026", "升华", "将牌暂时移出卡组，本场战斗结束后归还"),
            new("Keyword0027", "一次性", "对战结束后，将此卡永久移出玩家卡组"),
            new("Keyword0028", "燃命", "左上角红色角标代表燃命，此牌需要消耗气血才能使用"),
            new("Keyword0029", "残血", "气血不到上限的25%，获得锻体之后阈值提升"),
            new("Keyword0030", "满血", "气血达到上限的100%，获得锻体之后阈值降低"),
            new("Keyword0031", "净化", "减少自己负面状态，对大多数负面状态有效"),
            new("Keyword0032", "爆能", "消耗额外灵气以激活效果"),
            new("Keyword0033", "碎防", "攻击抵消2点护甲"),
            new("Keyword0034", "禁忌", "打破禁忌时所付出的代价，禁忌包括禁止治疗，禁止护甲，禁止二动，禁止行动，禁止灵气，不堪一击"),
            new("Keyword0035", "幻影", "卡牌效果和所在位置有关"),
            new("Keyword0036", "合成", "参与合成并且成功时，就会触发效果"),
        });
    }
}
